---
kind: method
id: M:Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.#ctor
source: html/9e22a687-6c0a-6b1c-bca3-a5b4da1060ee.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.#ctor Method

Initializes a new instance of the DistributionSysTypeSet class

## Syntax (C#)
```csharp
public DistributionSysTypeSet()
```